posts/nano/tv-script-generation/tv-script-generation/index.org
#+BEGIN_COMMENT
.. title: TV Script Generation
.. slug: tv-script-generation
.. date: 2019-02-05 15:29:20 UTC-08:00
.. tags: rnn,project
.. category: Project
.. link: 
.. description: TV Script generation project.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 1
#+BEGIN_SRC ipython :session tv :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
* What is this about?
In this project, you'll generate your own [[https://en.wikipedia.org/wiki/Seinfeld][Seinfeld]] TV scripts using RNNs.  You'll be using part of the [[https://www.kaggle.com/thec03u5/seinfeld-chronicles#scripts.csv][Seinfeld dataset]] of scripts from 9 seasons.  The Neural Network you'll build will generate a new ,"fake" TV script, based on patterns it recognizes in this training data.
* Set Up
** Imports
*** Python
#+BEGIN_SRC ipython :session tv :results none
from collections import Counter
from pathlib import Path
import os
#+END_SRC
*** PyPi
#+BEGIN_SRC ipython :session tv :results none :exports none
from dotenv import load_dotenv
from tabulate import tabulate
#+END_SRC
*** Support Code
#+BEGIN_SRC ipython :session tv :results none
import udacity.project_tv_script_generation.problem_unittests as unittests
#+END_SRC
** Load Dotenv
#+BEGIN_SRC ipython :session tv :results none
load_dotenv()
#+END_SRC
* Get the Data
#+BEGIN_SRC ipython :session tv :results none
class Scripts:
    """Seinfeld Scripts

    Args:
     environment_key: environment variable with the source location
    """
    def __init__(self, environment_key: str="SCRIPTS") -> None:
        self.environment_key = environment_key        
        self._script_blob = None
        self._path = None
        self._lines = None
        self._tokens = None
        return

    @property
    def path(self) -> Path:
        """The path to the file"""
        if self._path is None:
            load_dotenv()
            self._path = Path(os.environ.get("SCRIPTS")).expanduser()
            assert self._path.is_file()
        return self._path

    @property
    def script_blob(self) -> str:
        """The input file as a string"""
        if self._script_blob is None:
            with open(self.path) as reader:
                self._script_blob = reader.read()
        return self._script_blob

    @property
    def lines(self) -> list:
        """The lines of the script"""
        if self._lines is None:
            self._lines = self.script_blob.split("\n")
        return self._lines

    @property
    def tokens(self) -> Counter:
        """The tokens and their counts"""
        if self._tokens is None:
            self._tokens = Counter()
            for token in self.script_blob.split():
                self._tokens[token] += 1
        return self._tokens
#+END_SRC

#+BEGIN_SRC ipython :session tv :results none
class ScriptInspector:
    """gets some basic counts

    Args:
     scripts: object with the scripts
    """
    def __init__(self, scripts: Scripts=None) -> None:
        self._scripts = scripts
        self._line_count = None
        self._count_per_line = None
        self._mean_words_per_line = None
        self._token_count = None
        return

    @property
    def scripts(self) -> Scripts:
        """The scripts object"""
        if self._scripts is None:
            self._scripts = Scripts()
        return self._scripts

    @property
    def line_count(self) -> int:
        """Number of lines in the source"""
        if self._line_count is None:
            self._line_count = len(self.scripts.lines)
        return self._line_count

    @property
    def count_per_line(self) -> list:
        """tokens per line"""
        if self._count_per_line is None:
            self._count_per_line = [len(line.split(" "))
                                    for line in self.scripts.lines]
        return self._count_per_line

    @property
    def mean_words_per_line(self) -> float:
        """Average number of words per line"""
        if self._mean_words_per_line is None:
            self._mean_words_per_line = (sum(self.count_per_line)
                                         /self.line_count)
        return self._mean_words_per_line

    @property
    def token_count(self) -> int:
        """Number of tokens in the text"""
        if self._token_count is None:
            self._token_count = sum(self.scripts.tokens.values())
        return self._token_count

    def most_common_tokens(self, count: int=10) -> list:
        """token, count tuples in descending rank

        Args:
         count: number of tuples to return in the list
        """
        return self.scripts.tokens.most_common(count)

    def line_range(self, start: int=0, stop: int=10) -> list:
        """lines within range

        Args:
         start: index of first line
         stop: upper bound for last line
        """
        return self.scripts.lines[start:stop]
#+END_SRC

The scripts aren't really in a format that is optimized for pandas, at least not for this initial look, so we'll just load it as text.

#+BEGIN_SRC ipython :session tv :results none
inspector = ScriptInspector()
#+END_SRC

