posts/nano/tv-script-generation/tv-script-generation/index.html
<!DOCTYPE html>
<html lang="en" prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#">
<head>
<meta charset="utf-8">
<meta content="TV Script generation project." name="description">
<meta content="width=device-width, initial-scale=1" name="viewport">
<title>TV Script Generation | In Too Deep</title>
<link href="../../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<meta content="Nikola (getnikola.com)" name="generator">
<link href="../../../../rss.xml" rel="alternate" title="RSS" type="application/rss+xml">
<link href="https://necromuralist.github.io/In-Too-Deep/posts/nano/tv-script-generation/tv-script-generation/" rel="canonical"><!--[if lt IE 9]><![endif]-->
<meta content="Cloistered Monkey" name="author">
<link href="../../../more-links/" rel="prev" title="More Links" type="text/html">
<meta content="In Too Deep" property="og:site_name">
<meta content="TV Script Generation" property="og:title">
<meta content="https://necromuralist.github.io/In-Too-Deep/posts/nano/tv-script-generation/tv-script-generation/" property="og:url">
<meta content="TV Script generation project." property="og:description">
<meta content="article" property="og:type">
<meta content="2019-02-05T15:29:20-08:00" property="article:published_time">
<meta content="project" property="article:tag">
<meta content="rnn" property="article:tag">
</head>
<body>
<a class="sr-only sr-only-focusable" href="#content">Skip to main content</a> <!-- Menubar -->
<nav class="navbar navbar-expand-md static-top mb-4 navbar-light bg-light">
<div class="container"><!-- This keeps the margins nice -->
 <a class="navbar-brand" href="https://necromuralist.github.io/In-Too-Deep/"><span id="blog-title">In Too Deep</span></a> <button aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation" class="navbar-toggler" data-target="#bs-navbar" data-toggle="collapse" type="button"><span class="navbar-toggler-icon"></span></button>
<div class="collapse navbar-collapse" id="bs-navbar">
<ul class="navbar-nav mr-auto">
<li class="nav-item"><a class="nav-link" href="../../../../archive.html">Archive</a></li>
<li class="nav-item"><a class="nav-link" href="../../../../categories/">Tags</a></li>
<li class="nav-item"><a class="nav-link" href="../../../../rss.xml">RSS feed</a></li>
<li class="nav-item"><a class="nav-link" href="https://necromuralist.github.io/">Cloistered Monkey</a></li>
</ul>
<!-- Google custom search -->
<form action="https://www.google.com/search" class="navbar-form navbar-right" method="get" role="search">
<div class="form-group"><input class="form-control" name="q" placeholder="Search" type="text"></div>
<!-- 
<button type="submit" class="btn btn-primary">
        <span class="glyphicon glyphicon-search"></span>
</button>
-->
<input name="sitesearch" type="hidden" value="https://necromuralist.github.io/In-Too-Deep/"></form>
<!-- End of custom search -->
<ul class="navbar-nav navbar-right">
<li class="nav-item"><a class="nav-link" href="index.org" id="sourcelink">Source</a></li>
</ul>
</div>
<!-- /.navbar-collapse --></div>
<!-- /.container --></nav>
<!-- End of Menubar -->
<div class="container" id="content" role="main">
<div class="body-content"><!--Body content-->
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article">
<header>
<h1 class="p-name entry-title" itemprop="headline name"><a class="u-url" href=".">TV Script Generation</a></h1>
<div class="metadata">
<p class="byline author vcard"><span class="byline-name fn" itemprop="author">Cloistered Monkey</span></p>
<p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2019-02-05T15:29:20-08:00" itemprop="datePublished" title="2019-02-05 15:29">2019-02-05 15:29</time></a></p>
<p class="sourceline"><a class="sourcelink" href="index.org">Source</a></p>
</div>
</header>
<div class="e-content entry-content" itemprop="articleBody text">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb224de0">What is this about?</a></li>
<li><a href="#orgeeb2191">Set Up</a></li>
<li><a href="#orgd1c1622">Get the Data</a></li>
<li><a href="#org9fc01e3">Explore the Data</a></li>
<li><a href="#org785a27b">Pre-Processing the Text</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="outline-container-orgb224de0">
<h2 id="orgb224de0">What is this about?</h2>
<div class="outline-text-2" id="text-orgb224de0">
<p>In this project, you'll generate your own <a href="https://en.wikipedia.org/wiki/Seinfeld">Seinfeld</a> TV scripts using RNNs. You'll be using part of the <a href="https://www.kaggle.com/thec03u5/seinfeld-chronicles#scripts.csv">Seinfeld dataset</a> of scripts from 9 seasons. The Neural Network you'll build will generate a new ,"fake" TV script, based on patterns it recognizes in this training data.</p>
</div>
</div>
<div class="outline-2" id="outline-container-orgeeb2191">
<h2 id="orgeeb2191">Set Up</h2>
<div class="outline-text-2" id="text-orgeeb2191"></div>
<div class="outline-3" id="outline-container-orge53924b">
<h3 id="orge53924b">Imports</h3>
<div class="outline-text-3" id="text-orge53924b"></div>
<div class="outline-4" id="outline-container-org83faf6d">
<h4 id="org83faf6d">Python</h4>
<div class="outline-text-4" id="text-org83faf6d">
<div class="highlight">
<pre><span></span>from collections import Counter
from pathlib import Path
import os
</pre></div>
</div>
</div>
<div class="outline-4" id="outline-container-orgcaf0e70">
<h4 id="orgcaf0e70">PyPi</h4>
</div>
<div class="outline-4" id="outline-container-org21ed799">
<h4 id="org21ed799">Support Code</h4>
<div class="outline-text-4" id="text-org21ed799">
<div class="highlight">
<pre><span></span>import udacity.project_tv_script_generation.problem_unittests as unittests
</pre></div>
</div>
</div>
</div>
<div class="outline-3" id="outline-container-org14c2281">
<h3 id="org14c2281">Load Dotenv</h3>
<div class="outline-text-3" id="text-org14c2281">
<div class="highlight">
<pre><span></span>load_dotenv()
</pre></div>
</div>
</div>
</div>
<div class="outline-2" id="outline-container-orgd1c1622">
<h2 id="orgd1c1622">Get the Data</h2>
<div class="outline-text-2" id="text-orgd1c1622">
<div class="highlight">
<pre><span></span>class Scripts:
    """Seinfeld Scripts

    Args:
     environment_key: environment variable with the source location
    """
    def __init__(self, environment_key: str="SCRIPTS") -&gt; None:
        self.environment_key = environment_key        
        self._script_blob = None
        self._path = None
        self._lines = None
        self._tokens = None
        return

    @property
    def path(self) -&gt; Path:
        """The path to the file"""
        if self._path is None:
            load_dotenv()
            self._path = Path(os.environ.get("SCRIPTS")).expanduser()
            assert self._path.is_file()
        return self._path

    @property
    def script_blob(self) -&gt; str:
        """The input file as a string"""
        if self._script_blob is None:
            with open(self.path) as reader:
                self._script_blob = reader.read()
        return self._script_blob

    @property
    def lines(self) -&gt; list:
        """The lines of the script"""
        if self._lines is None:
            self._lines = self.script_blob.split("\n")
        return self._lines

    @property
    def tokens(self) -&gt; Counter:
        """The tokens and their counts"""
        if self._tokens is None:
            self._tokens = Counter()
            for token in self.script_blob.split():
                self._tokens[token] += 1
        return self._tokens
</pre></div>
<div class="highlight">
<pre><span></span>class ScriptInspector:
    """gets some basic counts

    Args:
     scripts: object with the scripts
    """
    def __init__(self, scripts: Scripts=None) -&gt; None:
        self._scripts = scripts
        self._line_count = None
        self._count_per_line = None
        self._mean_words_per_line = None
        self._token_count = None
        return

    @property
    def scripts(self) -&gt; Scripts:
        """The scripts object"""
        if self._scripts is None:
            self._scripts = Scripts()
        return self._scripts

    @property
    def line_count(self) -&gt; int:
        """Number of lines in the source"""
        if self._line_count is None:
            self._line_count = len(self.scripts.lines)
        return self._line_count

    @property
    def count_per_line(self) -&gt; list:
        """tokens per line"""
        if self._count_per_line is None:
            self._count_per_line = [len(line.split(" "))
                                    for line in self.scripts.lines]
        return self._count_per_line

    @property
    def mean_words_per_line(self) -&gt; float:
        """Average number of words per line"""
        if self._mean_words_per_line is None:
            self._mean_words_per_line = (sum(self.count_per_line)
                                         /self.line_count)
        return self._mean_words_per_line

    @property
    def token_count(self) -&gt; int:
        """Number of tokens in the text"""
        if self._token_count is None:
            self._token_count = sum(self.scripts.tokens.values())
        return self._token_count

    def most_common_tokens(self, count: int=10) -&gt; list:
        """token, count tuples in descending rank

        Args:
         count: number of tuples to return in the list
        """
        return self.scripts.tokens.most_common(count)

    def line_range(self, start: int=0, stop: int=10) -&gt; list:
        """lines within range

        Args:
         start: index of first line
         stop: upper bound for last line
        """
        return self.scripts.lines[start:stop]
</pre></div>
<p>The scripts aren't really in a format that is optimized for pandas, at least not for this initial look, so we'll just load it as text.</p>
<div class="highlight">
<pre><span></span>inspector = ScriptInspector()
</pre></div>
</div>
</div>
