posts/nano/tv-script-generation/tv-script-generation/index.org
* Explore the Data
  Note that the first line is a header, but we're ignoring that and including it with the counts. So this is /very/ rough.
#+BEGIN_SRC ipython :session tv :results none
view_line_range = (0, 10)
#+END_SRC

** Dataset Statistics
#+BEGIN_SRC ipython :session tv :results output raw :exports both
lines = (("Number of unique tokens", "{:,}".format(inspector.token_count)),
         ("Number of lines", "{:,}".format(inspector.line_count)),
         ("Average number of words in each line", "{:.2f}".format(
             inspector.mean_words_per_line)))
print(tabulate(lines, headers="Statistic Value".split(), tablefmt="orgtbl"))
#+END_SRC

#+RESULTS:
| Statistic                            | Value   |
|--------------------------------------+---------|
| Number of unique tokens              | 550,996 |
| Number of lines                      | 54,618  |
| Average number of words in each line | 10.09   |

** Top Ten Words
#+BEGIN_SRC ipython :session tv :results output raw :exports both
lines = ((token, "{:,}".format(count))
         for token, count in inspector.most_common_tokens())
print(tabulate(lines,
               tablefmt="orgtbl", headers=["Token", "Count"]))
#+END_SRC

#+RESULTS:
| Token | Count  |
|-------+--------|
| the   | 16,373 |
| I     | 13,911 |
| you   | 12,831 |
| a     | 12,096 |
| to    | 11,594 |
| of    | 5,490  |
| and   | 5,210  |
| in    | 4,741  |
| is    | 4,283  |
| that  | 4,047  |

So it looks like the stop words are the most common, as you might expect.

** The First five Lines
#+BEGIN_SRC ipython :session tv :results output :exports both
for line in inspector.line_range(stop=5):
    print(line)
#+END_SRC

#+RESULTS:
: ,Character,Dialogue,EpisodeNo,SEID,Season
: 0,JERRY,"Do you know what this is all about? Do you know, why were here? To be out, this is out...and out is one of the single most enjoyable experiences of life. People...did you ever hear people talking about We should go out? This is what theyre talking about...this whole thing, were all out now, no one is home. Not one person here is home, were all out! There are people tryin to find us, they dont know where we are. (on an imaginary phone) Did you ring?, I cant find him. Where did he go? He didnt tell me where he was going. He must have gone out. You wanna go out you get ready, you pick out the clothes, right? You take the shower, you get all ready, get the cash, get your friends, the car, the spot, the reservation...Then youre standing around, whatta you do? You go We gotta be getting back. Once youre out, you wanna get back! You wanna go to sleep, you wanna get up, you wanna go out again tomorrow, right? Where ever you are in life, its my feeling, youve gotta go.",1.0,S01E01,1.0
: 1,JERRY,"(pointing at Georges shirt) See, to me, that button is in the worst possible spot. The second button literally makes or breaks the shirt, look at it. Its too high! Its in no-mans-land. You look like you live with your mother.",1.0,S01E01,1.0
: 2,GEORGE,Are you through?,1.0,S01E01,1.0
: 3,JERRY,"You do of course try on, when you buy?",1.0,S01E01,1.0

As you can see it is a comma-separated file with a header. What's not so obvious is how the index works. Is it for all the lines? Since the episode number is in the row-data I would assume so.

* Pre-Processing the Text
The first thing to do to any dataset is pre-processing.  Implement the following pre-processing functions below:
 - Lookup Table
 - Tokenize Punctuation

