posts/nano/tv-script-generation/tv-script-generation/index.html
<div class="outline-2" id="outline-container-org9fc01e3">
<h2 id="org9fc01e3">Explore the Data</h2>
<div class="outline-text-2" id="text-org9fc01e3">
<p>Note that the first line is a header, but we're ignoring that and including it with the counts. So this is <i>very</i> rough.</p>
<div class="highlight">
<pre><span></span>view_line_range = (0, 10)
</pre></div>
</div>
<div class="outline-3" id="outline-container-org6a359c6">
<h3 id="org6a359c6">Dataset Statistics</h3>
<div class="outline-text-3" id="text-org6a359c6">
<div class="highlight">
<pre><span></span>lines = (("Number of unique tokens", "{:,}".format(inspector.token_count)),
         ("Number of lines", "{:,}".format(inspector.line_count)),
         ("Average number of words in each line", "{:.2f}".format(
             inspector.mean_words_per_line)))
print(tabulate(lines, headers="Statistic Value".split(), tablefmt="orgtbl"))
</pre></div>
<table border="2" cellpadding="6" cellspacing="0" frame="hsides" rules="groups">
<colgroup>
<col class="org-left">
<col class="org-left"></colgroup>
<thead>
<tr>
<th class="org-left" scope="col">Statistic</th>
<th class="org-left" scope="col">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Number of unique tokens</td>
<td class="org-left">550,996</td>
</tr>
<tr>
<td class="org-left">Number of lines</td>
<td class="org-left">54,618</td>
</tr>
<tr>
<td class="org-left">Average number of words in each line</td>
<td class="org-left">10.09</td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="outline-3" id="outline-container-org8f74d88">
<h3 id="org8f74d88">Top Ten Words</h3>
<div class="outline-text-3" id="text-org8f74d88">
<div class="highlight">
<pre><span></span>lines = ((token, "{:,}".format(count))
         for token, count in inspector.most_common_tokens())
print(tabulate(lines,
               tablefmt="orgtbl", headers=["Token", "Count"]))
</pre></div>
<table border="2" cellpadding="6" cellspacing="0" frame="hsides" rules="groups">
<colgroup>
<col class="org-left">
<col class="org-left"></colgroup>
<thead>
<tr>
<th class="org-left" scope="col">Token</th>
<th class="org-left" scope="col">Count</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">the</td>
<td class="org-left">16,373</td>
</tr>
<tr>
<td class="org-left">I</td>
<td class="org-left">13,911</td>
</tr>
<tr>
<td class="org-left">you</td>
<td class="org-left">12,831</td>
</tr>
<tr>
<td class="org-left">a</td>
<td class="org-left">12,096</td>
</tr>
<tr>
<td class="org-left">to</td>
<td class="org-left">11,594</td>
</tr>
<tr>
<td class="org-left">of</td>
<td class="org-left">5,490</td>
</tr>
<tr>
<td class="org-left">and</td>
<td class="org-left">5,210</td>
</tr>
<tr>
<td class="org-left">in</td>
<td class="org-left">4,741</td>
</tr>
<tr>
<td class="org-left">is</td>
<td class="org-left">4,283</td>
</tr>
<tr>
<td class="org-left">that</td>
<td class="org-left">4,047</td>
</tr>
</tbody>
</table>
<p>So it looks like the stop words are the most common, as you might expect.</p>
</div>
</div>
<div class="outline-3" id="outline-container-orgaea3838">
<h3 id="orgaea3838">The First five Lines</h3>
<div class="outline-text-3" id="text-orgaea3838">
<div class="highlight">
<pre><span></span>for line in inspector.line_range(stop=5):
    print(line)
</pre></div>
<pre class="example">
,Character,Dialogue,EpisodeNo,SEID,Season
0,JERRY,"Do you know what this is all about? Do you know, why were here? To be out, this is out...and out is one of the single most enjoyable experiences of life. People...did you ever hear people talking about We should go out? This is what theyre talking about...this whole thing, were all out now, no one is home. Not one person here is home, were all out! There are people tryin to find us, they dont know where we are. (on an imaginary phone) Did you ring?, I cant find him. Where did he go? He didnt tell me where he was going. He must have gone out. You wanna go out you get ready, you pick out the clothes, right? You take the shower, you get all ready, get the cash, get your friends, the car, the spot, the reservation...Then youre standing around, whatta you do? You go We gotta be getting back. Once youre out, you wanna get back! You wanna go to sleep, you wanna get up, you wanna go out again tomorrow, right? Where ever you are in life, its my feeling, youve gotta go.",1.0,S01E01,1.0
1,JERRY,"(pointing at Georges shirt) See, to me, that button is in the worst possible spot. The second button literally makes or breaks the shirt, look at it. Its too high! Its in no-mans-land. You look like you live with your mother.",1.0,S01E01,1.0
2,GEORGE,Are you through?,1.0,S01E01,1.0
3,JERRY,"You do of course try on, when you buy?",1.0,S01E01,1.0

</pre>
<p>As you can see it is a comma-separated file with a header. What's not so obvious is how the index works. Is it for all the lines? Since the episode number is in the row-data I would assume so.</p>
</div>
</div>
</div>
<div class="outline-2" id="outline-container-org785a27b">
<h2 id="org785a27b">Pre-Processing the Text</h2>
<div class="outline-text-2" id="text-org785a27b">
<p>The first thing to do to any dataset is pre-processing. Implement the following pre-processing functions below:</p>
<ul class="org-ul">
<li>Lookup Table</li>
<li>Tokenize Punctuation</li>
</ul>
</div>
