posts/nano/tv-script-generation/tv-script-generation/index.html
<div class="outline-3" id="outline-container-org74e1e0d">
<h3 id="org74e1e0d">Lookup Table</h3>
<div class="outline-text-3" id="text-org74e1e0d">
<p>To create a word embedding, you first need to transform the words to ids. In this function, create two dictionaries:</p>
<ul class="org-ul">
<li>Dictionary to go from the words to an id, we'll call <code>vocab_to_int</code></li>
<li>Dictionary to go from the id to word, we'll call <code>int_to_vocab</code></li>
</ul>
<p>Return these dictionaries in the following <b>tuple</b> <code>(vocab_to_int, int_to_vocab)</code></p>
<p>import problem_unittests as tests</p>
<p>def create_lookup_tables(text): """ Create lookup tables for vocabulary :param text: The text of tv scripts split into words :return: A tuple of dicts (vocab_to_int, int_to_vocab) """</p>
<p>return (None, None)</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL THAT IS BELOW THIS LINE """ tests.test_create_lookup_tables(create_lookup_tables)</p>
<p>def token_lookup(): """ Generate a dict to turn punctuation into a token. :return: Tokenized dictionary where the key is the punctuation and the value is the token """</p>
<p>return None</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL THAT IS BELOW THIS LINE """ tests.test_tokenize(token_lookup)</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL """</p>
<p>helper.preprocess_and_save_data(data_dir, token_lookup, create_lookup_tables)</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL """ import helper import problem_unittests as tests</p>
<p>int_text, vocab_to_int, int_to_vocab, token_dict = helper.load_preprocess()</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL """ import torch</p>
<p>train_on_gpu = torch.cuda.is_available() if not train_on_gpu: print('No GPU found. Please use a GPU to train your neural network.')</p>
<p>from torch.utils.data import TensorDataset, DataLoader</p>
<p>def batch_data(words, sequence_length, batch_size): """ Batch the neural network data using DataLoader :param words: The word ids of the TV scripts :param sequence_length: The sequence length of each batch :param batch_size: The size of each batch; the number of sequences in a batch :return: DataLoader with batched data """</p>
<p>return None</p>
<p>test_text = range(50) t_loader = batch_data(test_text, sequence_length=5, batch_size=10)</p>
<p>data_iter = iter(t_loader) sample_x, sample_y = data_iter.next()</p>
<p>print(sample_x.shape) print(sample_x) print() print(sample_y.shape) print(sample_y)</p>
<p>import torch.nn as nn</p>
<p>class RNN(nn.Module):</p>
<p>def __init__(self, vocab_size, output_size, embedding_dim, hidden_dim, n_layers, dropout=0.5): """ Initialize the PyTorch RNN Module :param vocab_size: The number of input dimensions of the neural network (the size of the vocabulary) :param output_size: The number of output dimensions of the neural network :param embedding_dim: The size of embeddings, should you choose to use them :param hidden_dim: The size of the hidden layer outputs :param dropout: dropout to add in between LSTM/GRU layers """ super(RNN, self).__init__()</p>
<p>def forward(self, nn_input, hidden): """ Forward propagation of the neural network :param nn_input: The input to the neural network :param hidden: The hidden state :return: Two Tensors, the output of the neural network and the latest hidden state """</p>
<p>return None, None</p>
<p>def init_hidden(self, batch_size): ''' Initialize the hidden state of an LSTM/GRU :param batch_size: The batch_size of the hidden state :return: hidden state of dims (n_layers, batch_size, hidden_dim) '''</p>
<p>return None</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL THAT IS BELOW THIS LINE """ tests.test_rnn(RNN, train_on_gpu)</p>
<p>def forward_back_prop(rnn, optimizer, criterion, inp, target, hidden): """ Forward and backward propagation on the neural network :param decoder: The PyTorch Module that holds the neural network :param decoder_optimizer: The PyTorch optimizer for the neural network :param criterion: The PyTorch loss function :param inp: A batch of input to the neural network :param target: The target output for the batch of input :return: The loss and the latest hidden state Tensor """</p>
<p>return None, None</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL THAT IS BELOW THIS LINE """ tests.test_forward_back_prop(RNN, forward_back_prop, train_on_gpu)</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL """</p>
<p>def train_rnn(rnn, batch_size, optimizer, criterion, n_epochs, show_every_n_batches=100): batch_losses = []</p>
<p>rnn.train()</p>
<p>print("Training for %d epoch(s)…" % n_epochs) for epoch_i in range(1, n_epochs + 1):</p>
<p>hidden = rnn.init_hidden(batch_size)</p>
<p>for batch_i, (inputs, labels) in enumerate(train_loader, 1):</p>
<p>n_batches = len(train_loader.dataset)//batch_size if(batch_i &gt; n_batches): break</p>
<p>loss, hidden = forward_back_prop(rnn, optimizer, criterion, inputs, labels, hidden)</p>
<p>batch_losses.append(loss)</p>
<p>if batch_i % show_every_n_batches == 0: print('Epoch: {:&gt;4}/{:&lt;4} Loss: {}\n'.format( epoch_i, n_epochs, np.average(batch_losses))) batch_losses = []</p>
<p>return rnn</p>
<p>sequence_length = # of words in a sequence</p>
<p>batch_size =</p>
<p>train_loader = batch_data(int_text, sequence_length, batch_size)</p>
<p>num_epochs =</p>
<p>learning_rate =</p>
<p>vocab_size =</p>
<p>output_size =</p>
<p>embedding_dim =</p>
<p>hidden_dim =</p>
<p>n_layers =</p>
<p>show_every_n_batches = 500</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL """</p>
<p>rnn = RNN(vocab_size, output_size, embedding_dim, hidden_dim, n_layers, dropout=0.5) if train_on_gpu: rnn.cuda()</p>
<p>optimizer = torch.optim.Adam(rnn.parameters(), lr=learning_rate) criterion = nn.CrossEntropyLoss()</p>
<p>trained_rnn = train_rnn(rnn, batch_size, optimizer, criterion, num_epochs, show_every_n_batches)</p>
<p>helper.save_model('./save/trained_rnn', trained_rnn) print('Model Trained and Saved')</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL """ import torch import helper import problem_unittests as tests</p>
<p>_, vocab_to_int, int_to_vocab, token_dict = helper.load_preprocess() trained_rnn = helper.load_model('./save/trained_rnn')</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL THAT IS BELOW THIS LINE """ import torch.nn.functional as F</p>
<p>def generate(rnn, prime_id, int_to_vocab, token_dict, pad_value, predict_len=100): """ Generate text using the neural network :param decoder: The PyTorch Module that holds the trained neural network :param prime_id: The word id to start the first prediction :param int_to_vocab: Dict of word id keys to word values :param token_dict: Dict of puncuation tokens keys to puncuation values :param pad_value: The value used to pad a sequence :param predict_len: The length of text to generate :return: The generated text """ rnn.eval()</p>
<p>current_seq = np.full((1, sequence_length), pad_value) current_seq[-1][-1] = prime_id predicted = [int_to_vocab[prime_id]]</p>
<p>for _ in range(predict_len): if train_on_gpu: current_seq = torch.LongTensor(current_seq).cuda() else: current_seq = torch.LongTensor(current_seq)</p>
<p>hidden = rnn.init_hidden(current_seq.size(0))</p>
<p>output, _ = rnn(current_seq, hidden)</p>
<p>p = F.softmax(output, dim=1).data if(train_on_gpu): p = p.cpu() # move to cpu</p>
<p>top_k = 5 p, top_i = p.topk(top_k) top_i = top_i.numpy().squeeze()</p>
<p>p = p.numpy().squeeze() word_i = np.random.choice(top_i, p=p/p.sum())</p>
<p>word = int_to_vocab[word_i] predicted.append(word)</p>
<p>current_seq = np.roll(current_seq, -1, 1) current_seq[-1][-1] = word_i</p>
<p>gen_sentences = ' '.join(predicted)</p>
<p>for key, token in token_dict.items(): ending = ' ' if key in ['\n', '(', '"'] else '' gen_sentences = gen_sentences.replace(' ' + token.lower(), key) gen_sentences = gen_sentences.replace('\n ', '\n') gen_sentences = gen_sentences.replace('( ', '(')</p>
<p>return gen_sentences</p>
<p>gen_length = 400 # modify the length to your preference prime_word = 'jerry' # name for starting the script</p>
<p>""" DON'T MODIFY ANYTHING IN THIS CELL THAT IS BELOW THIS LINE """ pad_word = helper.SPECIAL_WORDS['PADDING'] generated_script = generate(trained_rnn, vocab_to_int[prime_word + ':'], int_to_vocab, token_dict, vocab_to_int[pad_word], gen_length) print(generated_script)</p>
<p>f = open("generated_script_1.txt","w") f.write(generated_script) f.close()</p>
</div>
</div>
</div>
</div>
<aside class="postpromonav">
<nav>
<ul class="tags" itemprop="keywords">
<li><a class="tag p-category" href="../../../../categories/project/" rel="tag">project</a></li>
<li><a class="tag p-category" href="../../../../categories/rnn/" rel="tag">rnn</a></li>
</ul>
<ul class="pager hidden-print">
<li class="previous"><a href="../../../more-links/" rel="prev" title="More Links">Previous post</a></li>
</ul>
</nav>
</aside>
</article>
<!--End of body content-->
<footer id="footer">Contents © 2019 <a href="mailto:necromuralist@protonmail.com">Cloistered Monkey</a> - Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a></footer>
</div>
</div>
<script src="../../../../assets/js/all-nocdn.js"></script><!-- fancy dates -->
<script>

    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
</script><!-- end fancy dates -->
<script>

    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
</script>
</body>
</html>
